{
  "sodium.option_impact.low": "Низький",
  "sodium.option_impact.medium": "Середній",
  "sodium.option_impact.high": "Високий",
  "sodium.option_impact.extreme": "Екстримальний",
  "sodium.option_impact.varies": "Змінний",
  "sodium.option_impact.tooltip": "Вплив на потужність ПК: %s",
  "sodium.option_flag.requires_game_restart.tooltip": "Потребує перезапуску для набуття чинності",
  "sodium.options.pages.quality": "Якість",
  "sodium.options.pages.performance": "Потужність",
  "sodium.options.pages.advanced": "Розширені",
  "sodium.options.view_distance.tooltip": "Відстань візуалізації визначає, наскільки далеко відображатиметься місцевість. Менші відстані означають, що буде відтворено менше рельєфу, покращуючи частоту кадрів.",
  "sodium.options.simulation_distance.tooltip": "Симуляційна відстань визначає, як далеко буде завантажена місцевість та дія об’єктів. Коротші відстані можуть зменшити навантаження на внутрішній сервер і покращити частоту кадрів.",
  "sodium.options.brightness.tooltip": "Керує яскравістю (гамою) гри.",
  "sodium.options.gui_scale.tooltip": "Встановлює максимальний коефіцієнт масштабування для інтерфейсу користувача. Якщо використовується «авто», завжди використовуватиметься найбільший масштабний коефіцієнт.",
  "sodium.options.fullscreen.tooltip": "Якщо ввімкнено, гра відображатиметься на весь екран (якщо підтримується).",
  "sodium.options.v_sync.tooltip": "Якщо ввімкнено, частота кадрів гри буде синхронізована з частотою оновлення монітора, що загалом забезпечує більш плавну роботу за рахунок загальної затримки введення. Цей параметр може знизити продуктивність, якщо ваша система працює надто повільно.",
  "sodium.options.fps_limit.tooltip": "Обмежує максимальну кількість кадрів за секунду. Це може допомогти зменшити використання акумулятора та загальне навантаження на систему під час багатозадачності. Якщо V-Sync увімкнено, цей параметр ігноруватиметься, якщо він не нижчий за частоту оновлення дисплея.",
  "sodium.options.view_bobbing.tooltip": "Якщо ввімкнено, екран гравця коливатиметься та хитатиметься під час руху.",
  "sodium.options.attack_indicator.tooltip": "Контролює, де на екрані відображається індикатор атаки.",
  "sodium.options.autosave_indicator.tooltip": "Якщо ввімкнено то буде показано індикатор збереження світу на диск.",
  "sodium.options.graphics_quality.tooltip": "Якість графіки за умовчанням контролює деякі застарілі параметри та необхідна для сумісності модів. Якщо параметри нижче залишити \"За замовчуванням\", вони використовуватимуть це налаштування.",
  "sodium.options.clouds_quality.tooltip": "Контролює якість відтворених хмар на небі.",
  "sodium.options.weather_quality.tooltip": "Контролює якість ефектів дощу та снігу.",
  "sodium.options.leaves_quality.name": "Якість листя",
  "sodium.options.leaves_quality.tooltip": "Контролює якість листя.",
  "sodium.options.particle_quality.name": "Якість частинок",
  "sodium.options.particle_quality.tooltip": "Контролює максимальну кількість частинок, які можуть бути присутні на екрані.",
  "sodium.options.smooth_lighting.tooltip": "Контролює, чи будуть блоки плавно освітлені та затінені. Це трохи збільшує кількість часу, необхідного для повторного створення чанку, але не впливає на частоту кадрів.",
  "sodium.options.biome_blend.value": "%s блок(и)",
  "sodium.options.biome_blend.tooltip": "Керує відстанню змішування країв біомів. Більш високі значення значно збільшують кількість часу, необхідного для створення фрагментів для зменшення покращення якості.",
  "sodium.options.entity_distance.tooltip": "Контролює, на якій відстані об’єкти можуть відображатися від гравця. Вищі значення збільшують відстань візуалізації за рахунок частоти кадрів.",
  "sodium.options.entity_shadows.tooltip": "Якщо ввімкнено, основні тіні відображатимуться під мобами та іншими об’єктами.",
  "sodium.options.vignette.name": "Віньєтка",
  "sodium.options.vignette.tooltip": "Якщо ввімкнути, ефект затемнення або почервоніння кутів екрану буде відображено на екрані гравця при різних умовах. Дуже малоймовірно, що це вплине на частоту кадрів, якщо ви не обмежені частотою кадрів.",
  "sodium.options.mipmap_levels.tooltip": "Контролює кількість MIP-карт, які використовуватимуться для текстур блокової моделі. Вищі значення забезпечують кращу візуалізацію блоків на відстані, але можуть негативно вплинути на продуктивність багатьох анімованих текстур.",
  "sodium.options.use_block_face_culling.name": "Використовувати ховання блоків",
  "sodium.options.use_block_face_culling.tooltip": "Якщо ввімкнено, лише сторони блоків, які звернені до камери, надсилатимуться для візуалізації. Це може усунути велику кількість граней блоків на дуже ранніх стадіях процесу візуалізації, заощаджуючи пропускну здатність пам’яті та час на GPU. Деякі пакети ресурсів можуть мати проблеми з цією опцією, тому спробуйте вимкнути її, якщо ви бачите діри в блоках.",
  "sodium.options.use_fog_occlusion.name": "Використовувати туманну непрохідність",
  "sodium.options.use_fog_occlusion.tooltip": "Якщо ввімкнено, блоки, які визначено як повністю приховані ефектами туману, не відтворюватимуться, що сприяє покращенню продуктивності. Поліпшення може бути більш вражаючим, коли вплив туману сильніший (наприклад, під водою), але це може спричинити небажані візуальні артефакти між небом і туманом у деяких сценаріях..",
  "sodium.options.use_entity_culling.name": "Використовувати ховання сутностей",
  "sodium.options.use_entity_culling.tooltip": "Якщо ввімкнено, об’єкти, які не містяться у видимих фрагментах, пропускатимуться під час відтворення. Це може допомогти підвищити продуктивність, уникаючи відтворення об’єктів, розташованих під землею або за стінами.",
  "sodium.options.use_particle_culling.name": "Використовувати ховання частинок",
  "sodium.options.use_particle_culling.tooltip": "Якщо ввімкнено, відображатимуться лише ті частинки, які визначено як видимі. Це може забезпечити значне покращення частоти кадрів, коли багато частинок знаходяться поблизу.",
  "sodium.options.animate_only_visible_textures.name": "Анімувати лише видимі текстури",
  "sodium.options.animate_only_visible_textures.tooltip": "Якщо ввімкнено, оновлюватимуться лише анімовані текстури, визначені як видимі. Це може значно підвищити частоту кадрів на певному апаратному забезпеченні, особливо з більшими пакетами ресурсів. Якщо у вас виникають проблеми з відсутністю анімації деяких текстур, спробуйте вимкнути цю опцію.",
  "sodium.options.cpu_render_ahead_limit.name": "Обмеження CPU Render Ahead",
  "sodium.options.cpu_render_ahead_limit.tooltip": "Визначає максимальну кількість кадрів, які центральний процесор може чекати від графічного процесора, щоб завершити рендеринг. Дуже низькі значення можуть спричинити нестабільність частоти кадрів, а дуже високі значення можуть значно збільшити затримку введення та використання пам’яті.",
  "sodium.options.cpu_render_ahead_limit.value": "%s кадр(ів)",
  "sodium.options.allow_direct_memory_access.name": "Дозволити прямий доступ до пам'яті",
  "sodium.options.allow_direct_memory_access.tooltip": "Якщо ввімкнено, деяким критичним шляхам коду буде дозволено використовувати прямий доступ до пам’яті для продуктивності. Це часто значно зменшує навантаження на ЦП для рендерингу фрагментів і об’єктів, але може ускладнити діагностику деяких помилок і збоїв. Вам слід вимкнути це, лише якщо вас попросили або ви знаєте, що робите.",
  "sodium.options.enable_memory_tracing.name": "Увімкнути простежування пам'яті",
  "sodium.options.enable_memory_tracing.tooltip": "Функція налагодження. Якщо ввімкнено, трасування стека збиратимуться разом із виділенням пам’яті, щоб покращити діагностичну інформацію під час виявлення витоків пам’яті.",
  "sodium.options.chunk_update_threads.name": "Потоки оновлення чанків",
  "sodium.options.chunk_update_threads.tooltip": "Визначає кількість потоків для побудови чанків. Використання більшої кількості потоків може пришвидшити завантаження і швидкість оновлення чанків, але може негативно вплинути на частоту кадрів.",
  "sodium.options.always_defer_chunk_updates.name": "Завжди затримувати оновлення чанків",
  "sodium.options.always_defer_chunk_updates.tooltip": "Якщо ввімкнено, рендеринг ландшафту ніколи не чекатиме завершення оновлень чанків, навіть якщо вони важливі. Це може значно покращити частоту кадрів у деяких сценаріях, але також створити значну візуальну затримку у світі.",
  "sodium.options.use_compact_vertex_format.name": "Використовувати Compact Vertex Format",
  "sodium.options.use_compact_vertex_format.tooltip": "Якщо ввімкнено, геометрія блоку зберігатиметься у відеопам’яті з використанням більш компактного представлення. Це значно зменшує використання пам’яті та вимоги до пропускної здатності, але може спричинити проблеми з деякими пакетами ресурсів і графічними драйверами.",
  "sodium.options.use_model_instancing.name": "Використовувати Model Instancing",
  "sodium.options.use_model_instancing.tooltip": "Якщо ввімкнено, підтримувані моделі будуть упаковані у VBO та створені екземпляри. Це видаляє непотрібні завантаження в графічний процесор, надсилаючи лише перетворення для існуючих вершин. Це також видаляє багато непотрібних викликів малювання шляхом об’єднання багатьох схожих сутностей. Це може значно підвищити частоту кадрів, коли видно багато об’єктів.",
  "sodium.options.enable_api_debug.name": "Увімкнути API Debug",
  "sodium.options.enable_api_debug.tooltip": "Якщо ввімкнено, графічний API буде переведено в режим налагодження, що створюватиме більш детальні та корисні журнали для розробників. Якщо ввімкнено, це може призвести до певних витрат, тому вимикайте його, якщо це не потрібно.",
  "sodium.options.chunk_renderer_backend.name": "Chunk Renderer Backend",
  "sodium.options.chunk_renderer_backend.tooltip": "Вибирає серверну частину, яка використовуватиметься для візуалізації геометрії блоку.\n- За замовчуванням: намагається вибрати найкращий варіант для вашого графічного процесора.\n- BaseVertex: найбільш сумісний варіант, але споживає трохи більше відеопам’яті та може бути трохи повільнішим.\n - Непрямий: найшвидший варіант для деяких графічних процесорів, але може викликати графічні збої в драйверах з помилками.",
  "sodium.options.chunk_renderer_backend.base_vertex": "BaseVertex",
  "sodium.options.chunk_renderer_backend.indirect": "Непрямий",
  "sodium.options.translucent_face_sorting.name": "Translucent Face Sorting",
  "sodium.options.translucent_face_sorting.tooltip": "Якщо ввімкнено, напівпрозорі ефекти від поверхонь, таких як скло та вода, застосовуватимуться правильно. Для цього використовується обчислювальний шейдер, який працює на графічному процесорі, але диспетчеризація все одно дещо впливатиме на ЦП.",
  "sodium.options.buttons.undo": "Скасувати",
  "sodium.options.buttons.apply": "Застосувати",
  "sodium.options.buttons.donate": "Пригостіть нас кавою! :)"
}
